import {QuestionList} from '../../types';
import Img from '../../img/scenes/page_05.jpg'

export const Day1: QuestionList = [{
    id: 101,
    img: Img,
    question: `Ви отримуєте вкрай вигідне замовлення по дорозі в центр, куди самі ж і направляєтеся.`,
    answers: [
        {
            id: 1,
            text: 'Далі >>',
            next: 102,
        },
    ],
},
    {
        id: 102,
        question: `Під'їжджаєте до точки посадки, а тут все вщент запарковано. Припаркуватися немає можливості. Ви вмощуєте авто на аварійці, а в додатку натискаєте «Авто на місці». Час від часу вам сигналять інші сигналять інші водії. Написати в чат пасажиру, що тут ви не зможете довго чекати?`,
        answers: [
            {
                id: 1,
                text: 'Так',
                next: 103,
            },
            {
                id: 2,
                text: 'Ні, просто зачекаю',
                next: 201,
            },
        ],
    },
    {
        id: 201,
        question: `Пасажир довго не виходить, у вас закінчується терпець. Ви зателефонуєте чи просто скасуєте замовлення і поїдете?`,
        answers: [
            {
                id: 1,
                text: 'Телефоную.',
                next: 103,
            },
            {
                id: 2,
                text: 'Скасовую замовленя',
                next: 202,
            },
        ],
    },
    {
        id: 202,
        question: `Можливо, це й на краще, бо тут не місце для парковки. Проте і 5 зірок ви цього разу точно не отримаєте, тому не проґавте свій шанс наступного разу!`,
        answers: [
            {
                id: 1,
                text: 'Працюю далі >>',
                next: 0,
            },
        ],
    },
    {
        id: 103,
        question: `Пасажир довго не бере слухавку,  потім сильно перепрошує й каже, що вийде ще за 5 хвилин. Він перепрошує за незручності й обіцяє віддячити чайовими за цю ситуацію. Ваші дії?`,
        answers: [
            {
                id: 1,
                text: 'Почекаю.',
                next: 104,
            },
            {
                id: 2,
                text: 'Скасовую замовлення, аби не блокувати рух.',
                next: 203,
            },
        ],
    },
    {
        id: 203,
        question: `Можливо, це й на краще. Проте і 5 зірок ви цього разу точно не отримаєте, тому не проґавте свій шанс наступного разу!`,
        answers: [
            {
                id: 1,
                text: 'Працюю далі >>',
                next: 0,
            },
        ],
    },
    {
        id: 104,
        question: `<p>Вам сигналять з усіх боків, але маєте міцні нерви, тому просто робите музику гучніше. За сім хвилин до вас сідає запеханий пасажир, перепрошує і розповідає про складний день на роботі. Нарешті, рушаєте. </p>
<p>Пояснити пасажиру, що він щойно створив вам неабияке випробовування на міцність, але ви справилися, хоча вас могли отримати штраф?</p>`,
        answers: [
            {
                id: 1,
                text: 'Все ж, викажу невдоволення.',
                next: 204,
            },
            {
                id: 2,
                text: 'Ні, ми їдемо і добре.',
                next: 205,
            },
            {
                id: 3,
                text: 'Так, я спокійно поясню, аби такого більше не траплялося.',
                next: 206,
            },
        ],
    },
    {
        id: 204,
        question: `Пасажир ще сильніше вибачається. Дорога займає не набагато більше часу, ніж очікування навіть попри затори.`,
        answers: [
            {
                id: 1,
                text: 'Далі >>',
                next: 207,
            },
        ],
    },
    {
        id: 205,
        question: `Дорога займає не набагато більше часу, ніж очікування попри затори й ви прощаєтесь.`,
        answers: [
            {
                id: 1,
                text: 'Далі >>',
                next: 208,
            },
        ],
    },
    {
        id: 206,
        question: `Пасажир ще сильніше перепрошує. Дорога займає не набагато більше часу, ніж очікування попри затори й ви прощаєтесь.`,
        answers: [
            {
                id: 1,
                text: 'Далі >>',
                next: 209,
            },
        ],
    },
    {
        id: 207,
        rate: 3,
        question: `Поїздку завершено! Ви отримуєте 3 зірки від пасажира і 100 грн чайових. Мабуть, образився і вирішив відкупитися.`,
        answers: [
            {
                id: 1,
                text: 'Працюю далі >>',
                next: 0,
            },
        ],
    },
    {
        id: 208,
        rate: 5,
        question: `Поїздку завершено! Вітаємо, ви отримуєте 5 зірок від задоволеного пасажира і 20 грн чайових!`,
        answers: [
            {
                id: 1,
                text: 'Працюю далі >>',
                next: 0,
            },
        ],
    },
    {
        id: 209,
        question: `Поїздку завершено! Вітаємо, ви отримуєте 5 зірок від задоволеного пасажира і 30 грн чайових!`,
        rate: 5,
        answers: [
            {
                id: 1,
                text: 'Працюю далі >>',
                next: 0,
            },
        ],
    },
];
