import Bg1 from '../img/bg.png';
import {QuestionList} from '../types';
import {drivers} from '../const';
import Cover from '../img/cover.svg'

export const BeginList: QuestionList = [{
    id: 101,
    img: Cover,
    question: `
<p>Спробуйте себе у ролі водія! Мета гри – отримати 5 зірочок за поїздку від пасажирів хоча б 3 рази. Ви маєте 6 спроб.</p>
<p>Історії, в яких ви будете брати участь, засновані на реальних подіях, що трапились з водіями Uklon.</p>
    `,
    answers: [
        {
            id: 1,
            text: 'Поїхали!',
            next: 102,
        },
    ],
},
    {
        id: 102,
        question: `Оберіть свого персонажа.`,
        answers: [{
            id: 1,
            character: `Микита, вимушений переселенець, мешкає у Києві з травня 2022 року
Рейтинг: 4,8
Авто: Volkswagen Golf
В Uklon: 4 місяці
           `
        ,
            text:`Для Микити це – основне місце роботи. Цінує Uklon за гнучкий графік та стабільний заробіток.`,
            img:drivers[0],
            next: 103},
            {
                id: 2,
                character: `Ігор, живе та працює в Одесі
Рейтинг: 4,9
Авто: Hyundai Accent
В Uklon: 3 роки`
                ,
                text:`Для Ігора робота з Uklon — підробіток. Він береться за пару вигідних замовлень на день, коли з пасажиром по дорозі. Цінує можливість додаткового заробітку.`,
                img:drivers[1],
                next: 104},
        ],

    },
    {id: 103,
        question: `Микита налаштований отримувати лише «п'ятірки», адже з переїздом до нового міста його родина отримала багато фінансових викликів.`,
        answers: [
            {
                id: 1,
                text: 'До роботи!',
                next: 1101,
            },
        ],
    },
    {id: 104,
        question: `Ігор налаштований отримувати лише «п'ятірки», аби допомогти товаришу у ЗСУ назбирати на дрон для підрозділу.`,
        answers: [
            {
                id: 1,
                text: 'До роботи!',
                next: 1101,
            },
        ],
    },

]