import {QuestionList} from '../../types';

export const Day3: QuestionList = [{
    id: 101,
    question: `
    <p>Цей вечір ви обіцяли провести з родиною. Дружина готує вечерю, а старший син чекає, аби разом пограти на приставці. Проте погода сильно псується, що означає вищий тариф. Ще й Uklon повідомляє водіїв про спеціальний бонус цього вечора за 7 поїздок. </p>
<p>Гроші вам дуже потрібні, але й родину засмучувати ви не хочете. Що робити?</p>`,
    answers: [
        {
            id: 1,
            text: 'Їду додому — всіх грошей не заробиш.',
            next: 201,
        },
        {
            id: 2,
            text: 'Я маю працювати.',
            next: 102,
        },
    ],
},
    {
        id: 201,
        question: `Ви чудово проводите цей вечір, проте, закриваючи очі перед сном, підраховуєте гроші, які ви могли б заробити сьогодні.`,
        answers: [
            {
                id: 1,
                text: 'До наступного дня >>',
                next: 0,
            },
        ],
    },
    {
        id: 102,
        question: `Дружина підтримала ваше рішення, а от син геть образився. Він дуже чекав на вас. Та вибір зроблено, тож до роботи!`,
        answers: [
            {
                id: 1,
                text: 'Я передумав і їду додому',
                next: 201,
            },
            {
                id: 2,
                text: 'Працюю',
                next: 103,
            },
        ],
    },
    {
        id: 103,
        question: `Чудово! Ви вже розвезли шестеро пасажирів. Лишається одна поїздка до бонусу від Uklon. Ви обираєте  замовлення у свій район й хутко прибуваєте на точку. До вас сідає дівчина. Ви швидко прибуваєте до пункту призначення й вона виходить.`,
        answers: [
            {
                id: 1,
                text: 'Далі >>',
                next: 104,
            },
        ],
    },
    {
        id: 104,
        question: `Ура! Бонус отримано і ви вирушаєте додому і, можливо, ще встигнете пів години побути з сином й розрадити його. Припаркувавшись біля власного під'їзду, ви оглядаєте салон і бачите жіночу сумочку, яку хтось залишив. Мабуть, її забула остання пасажирка, проте ви не впевнені. Що робити?`,
        answers: [
            {
                id: 1,
                text: 'Телефоную пасажирці',
                next: 105,
            },
            {
                id: 2,
                text: 'Звертаюся до служби підтримки Uklon, де допоможуть з цією ситуацією. Сам поспішаю додому.',
                next: 202,
            },
        ],
    },
    {
        id: 202,
        question: `Ситуацію вправно вирішено. Ви отримуєте 4 зірки від пасажирки і час, який проведете з сином.`,
        rate: 4,
        answers: [
            {
                id: 1,
                text: 'До наступного дня >>',
                next: 0,
            },
        ],
    },
    {
        id: 105,
        question: `Так, вона забула свою сумку і дуже просить завезти їй. Готова оплатити поїздку в обидві сторони. Хочеться закрити це питання сьогодні, але тоді вам точно не вдасться провести вечір із сином. Ваші дії?`,
        answers: [
            {
                id: 1,
                text: 'Їду і завожу сумку, аби ще заробити.',
                next: 106,
            },
        ],
    },
    {
        id: 106,
        question: `Ви ідеальний водій і отримуєте 5 зірок від пасажирки! І навіть 30 грн чайових. Проте син на вас усе ще ображений.`,
        rate: 5,
        answers: [
            {
                id: 1,
                text: 'Перейти до наступного дня >>',
                next: 0,
            },
        ],
    },
];
