import { QuestionList } from "./types";
import Bg1 from './img/bg.png';
import Bg2 from './img/bg.png';

export const questionMock: QuestionList = [{
    id: 101,
    question: `
    Ви отримуєте непогане замовлення в новий для себе мікрорайон міста. Пасажир сідає й одразу запитує, чи ви місцевий. Що відповідаєте?
    `,
    img: Bg1,
    answers: [
        {
            id: 1,
            text: 'Чесно кажу, що ні',
            next: 102,
        },
        {
            id: 2,
            text: 'Намагаюсь віджартуватись, що у Києві давно не лишилось справжніх місцевих',
            next: 102,
        }
    ],
},
{
    id: 102,
    question: `Пасажир киває та просить не дивитись у навігатор, а дослухатися його порад. Він народився і виріс у Києві, сам тривалий час працював у таксі, тож знає тут кожен камінь. Просить їхати маловідомою дорогою, про яку знають лише місцеві. Погоджуєтесь?`,
    img: Bg2,
    answers: [
        {
            id: 1,
            text: 'Так',
            next: 103,
        },
        {
            id: 2,
            text: 'Ні, не знаю дорогу, у випадку чогось, не хочу намотувати зайві кілометри',
            next: 201,
        }
    ],
},
{
    id: 201,
    question: `Пасажир заводить ностальгічну промову про часи, коли всі водії, які возили пасажирів, знали місто, а навігаторів взагалі не існувало. Підтримати розмову?`,
    answers: [
        {
            id: 1,
            text: 'Ні, це марно',
            next: 202,
        },
        {
            id: 2,
            text: 'Так, скажу, що за тих часів я би зараз взагалі не мав роботи',
            next: 203,
        },
    ],
},
    {
        id: 202,
        question: `Пасажир розчарований ще й вашим мовчанням. Ви їдете решту шляху мовчки.`,
        answers: [
            {
                id: 1,
                text: 'Завершивши поїздку, ви отримуєте 3 зірки від любителя поностальгувати.',
                next: 0,
            },
        ],
    },
    {
        id: 203,
        question: `У вас завязується розмова про війну, безробіття, економікуй політику. Ви би говорили ще годину, якби поїздку не було завершено.`,
        answers: [
            {
                id: 1,
                text: 'Пасажир поставив вам 4 зірки і відгук, як про чудового співрозмовника',
                next: 0,
            },
        ],
    },
    {
        id: 103,
        question: `Ви починаєте їхати. Все йде за планом. Раптом, помічаєте попередження про ремонт дороги й тупик. Пасажир зітхає й говорить, що давно тут не їздив і не очікував, що все перекрито.
Далі їхатемите за навігатором чи порадами цього чоловіка?`,
        answers: [
            {
                id: 1,
                text: 'Продовжую слухати пасажира',
                next: 204,
            },
            {
                id: 2,
                text: 'Далі за навігатором, урок вивчено',
                next: 201,
            }
        ],
    },
    {
        id: 204,
        question: `До кінця шляху маловідома дорога для місцевих не робить більше сюрпризів, проте ви бачите, що ви геть не виграли за кілометражем і навіть намотали трохи більше. Сказати про це?`,
        answers: [
            {
                id: 1,
                text: 'Ні',
                next: 205,
            },
            {
                id: 2,
                text: 'Так',
                next: 206,
            }
        ],
    },
    {
        id: 205,
        question: `Пасажир радісно з вами прощається, думаючи, що йому вдалося вас вразити й скоротити шлях.`,
        answers: [
            {
                id: 1,
                text: 'Ви отримуєте 5 зірок від пасажира',
                next: 0,
            },
        ],
    },
    {
        id: 206,
        question: `Пасажир здивовано на вас дивиться й не вірить вашим словам. Ви прощаєтесь.`,
        answers: [
            {
                id: 1,
                text: 'Ви отримуєте 4 зірки за поїздку',
                next: 0,
            },
        ],
    },

];

